app/Models/UserModel.php

    public function login($username, $password)
    {
        $user = $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'gggaming'
 LIMIT 1